Revit 2027 API
BuiltInFailures.WallFailures.ContFootingCannotJoin Property
 Miter plane for Wall Foundation join is too far away; Bisecting plane will be used instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContFootingCannotJoin { get; }
Public Shared ReadOnly Property ContFootingCannotJoin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContFootingCannotJoin {
	FailureDefinitionId^ get ();
}
static member ContFootingCannotJoin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace